#Написать програму для проверки пароля .
print("пароль 123456zxc")
#У пользователя запрашивается пароль сравнивается с ожидаемой фразой
print("Введите пароль")
password=input(" ")
if  (password=="123456zxc"):
    print("Welcome!!!")
else:
    print("Неправильный пароль")
    print("Введите заново")






