from my_package import module_2

print('Напишите свой простой класс исключений')
name = input('Введите логин(правильный логин ihor.i147):')
module_2.f_login(name)

print('В примере работы декорированых функций вызвать функции с одинаковыми '
      'последовательностями и одинковыми числами для поиска - и сравнить какой '
      'метод работы в выигрше по првемени')
print(f"Первый линейный поиск занимает {module_2.compare1} , второй линейный "
      f"поиск "
      f"{module_2.compare2} секунд на " f""
      f"{module_2.compare1-module_2.compare2} "
      f"секунд "
      f"меньше")
print('Напишите функцию используя обрабатку исключений, которая запрашивает '
      'ввод двух значений.Если хотя бы одно из них не является числом, то'
      ' должна выполняться конкатенация')
module_2.tapeerror()
print(help(module_2))
